'use strict';

//============================
// alert( null || 2 || undefined ); // 2


//=============================
// alert( alert(1) || 2 || alert(3) ); // alert(1)=> undefined и 2

//=============================
// alert( 1 && null && 2 ); // null 

//=============================
// alert( alert(1) && alert(2) ); // выполнит alert(1) и после выведет undefined

//=============================
// alert( null || 2 && 3 || 4 ); // 3 

//=============================
/* let age = prompt("Ваш возраст?", " ");

if (age >= 14 && age <= 90) {
	alert ('confirm');
} */

//=============================
/* if (age < 14 || age > 90 );

if (!(age >= 14 || age <= 90));   */

//=============================
/* if (-1 || 0) alert( 'first' ); // -1 выполнится 
if (-1 && 0) alert( 'second' ); // 0 выполнится ---ОТВЕТ - не выполнится  -1 && 0 = 0,  в логическом контексте false
if (null || -1 && 1) alert( 'third' ); // 1 невыполнится  ---ОТВЕТ - выполнится  */

//=============================
let userName = prompt ('Веедите Ваш логин?', ' ');
if (userName == "Админ") {
	let userPassword = prompt ('Веедите Ваш пароль?', ' ');
	if (userPassword == 'Я главный') {
		alert ('Здравствуйте!');
	} else if (userPassword == null) {
		alert ('Отменено');
	} else {
		alert ('Неверный пароль');
	}
} else if (userName == null) {
	alert ('Отменено');
} else {
	alert ('Я вас не знаю');
}